'use client'

import { Card } from "antd";

export default function About() {
  return (
    <Card title="אודות Carenet" style={{ width: '100%', padding: '20px' }}>
    <h2>ברוכים הבאים ל-Carenet</h2>
    <p>המרכז המוביל לשירותים בתחום בריאות הנפש בישראל. ב-Carenet, אנו מחויבים להקל על הדרך אל טיפול נפשי איכותי ומתאים לכל אדם.</p>

    <br></br>

    <h3><strong>המטרה שלנו</strong>   </h3>
    <p>לפשט את התהליך של מציאת טיפול נפשי. מערכת חיפוש חכמה ויעילה, המאפשרת למצוא את הטיפול המתאים בצורה הטובה ביותר.</p>

    <br></br>

    <h3><strong>שירותים ויכולות</strong>   </h3>

    <ul>
        <li><strong>חיפוש מהיר וחכם:</strong> מערכת החיפוש מותאמת להעדפות האישיות וצרכים ספציפיים.</li>
        <li><strong>נגישות בשפות שונות:</strong> מערכת החיפוש תומכת במגוון שפות, לנגישות מירבית.</li>
    </ul>

    <br></br>
    <h3><strong>התחייבות לאיכות</strong>   </h3>

    <p>מרכזים את המודעות ממגוון מקורות, עם הזכויות שמורות למקור ההודעה. מידע איכותי ומהימן.</p>

    <br></br>

    <h3><strong>צרו קשר</strong>   </h3>

    <p>לכל שאלה או התעניינות, אל תהססו לפנות אלינו.</p>
</Card>
);
}
