import re
import requests
from libs.interfaces.document import Document
import textdistance


def get_locations_by_coordination(lat: float, lon: float):
    url = f"https://nominatim.openstreetmap.org/reverse?format=json&lat={lat}&lon={lon}"
    response = requests.get(url)
    if response.status_code == 200:
        data = response.json()
        # Depending on the response structure, you might need to adjust the keys
        full_location = data.get("display_name", "")
        address = data.get("address", {})
        city = address.get("city", address.get("town", address.get("village", "")))
        state = address.get("state", "")
        return full_location, city, state
    else:
        return "", "", ""


def extract_phone(text: str):
    if not text:
        return ""

    # Regular expression for extracting phone numbers
    phone_pattern = re.compile(r'\b\d{3}[-.]?\d{3}[-.]?\d{4}\b')
    matches = phone_pattern.findall(text)

    return ', '.join(matches) if matches else ""


def extract_email(text: str):
    if not text:
        return ""

    # Regular expression for extracting email addresses
    email_pattern = re.compile(r'\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Z|a-z]{2,}\b')
    match = email_pattern.search(text)

    return match.group() if match else ""


def extract_description(text):
    if not text:
        return ""

    # Regular expression to identify HTML tags
    tag_re = re.compile(r'<[^>]+>')

    # Remove the HTML tags
    return tag_re.sub('', text)

def extract_labeled_region_from_text(text: str) -> str:
    """Extracts the region from a given string"""

    # regular expression to match 'מחוז' followed by any characters except ',' (non-greedy) until a ','
    pattern = r"מחוז(.*?),"
    
    regions = ['מחוז ירושלים','מחוז הצפון','מחוז הדרום','מחוז חיפה','מחוז תל אביב','ארצי - מרחוק','מחוז המרכז']

    # search for the pattern in the text
    match = re.search(pattern, text)

    region = "מחוז " + match.group(1).strip() if match else ''
    
    return region if region in regions else ''


def extract_region_by_city(city: str) -> str:
    """This function gets a city and return its region using the api of openstreetmap """

    try:
        url = f'https://nominatim.openstreetmap.org/search?city={city}&format=json&accept-language=he'
        response = requests.get(url).json()[0]  # take the first record, sometimes it returns more than one

        city_details = response.get('display_name', "")  # example of the var : עכו, נפת עכו, מחוז הצפון, ישראל

        # happens when there is no such city in the API or city name is not in the api dataset
        
        return '' if len(city_details) == 0 else extract_labeled_region_from_text(city_details)

    except Exception as e:
        return ''
    

def join_elements_with_separator(elements: list) -> str:
    if len(elements) == 0:
        return ''
    else:
        concatenated_string = ', '.join(elements)
        return concatenated_string
    

def extract_geo_loc_from_city(city: str) -> tuple:
    """Query the OpenStreetMap Nominatim API to get latitude and longitude for a given city """
    if city == '':
        return "None", "None"
    try:
        url = f'https://nominatim.openstreetmap.org/search?city={city}&format=json&limit=1'
        
        response = requests.get(url)
        if response.status_code == 200:
            results = response.json()
            if results:
                # extract latitude and longitude from the first result
                latitude = results[0].get('lat')
                longitude = results[0].get('lon')
                return str(latitude), str(longitude)
            else:
                return "None", "None"
        else:
            return "None", "None"
    except Exception as e:
        print(f"Error fetching geolocation for city '{city}': {e}")
        return "None", "None"


def insert_geo_loc_to_doc(docs:list[Document]) -> list[Document]:
        
    for doc in docs:
        city = doc.city if doc.city else ''  # Using dot notation to access attributes
        latitude, longitude = extract_geo_loc_from_city(city)
        
        # updating the document's attribute's
        doc.latitude = latitude
        doc.longitude = longitude
                
    return docs

def extract_geo_loc_from_region(region:str):        
    """Query the OpenStreetMap Nominatim API to get latitude and longitude for a given region """\
        
    if region == 'ארצי - מרחוק':
        return "None", "None"
    
    try:
        url = f"https://nominatim.openstreetmap.org/search?format=json&q={region}"
        
        response = requests.get(url)
        if response.status_code == 200:
            results = response.json()
            if results:
                # extract latitude and longitude from the first result
                latitude = results[0].get('lat')
                longitude = results[0].get('lon')
                return str(float(latitude)), str(float(longitude))
            else:
                return "None", "None"
        else:
            return "None", "None"
    except Exception as e:
        print(f"Error fetching geolocation for city '{region}': {e}")
        return "None", "None"
    
def extract_best_match(docs:list[Document]) -> Document:
    '''This function loop all the city & Regional Council in israel and find the best match using Jaro-Winkler similarity score'''
    
    cities_israel_heb = ['תרום', 'תראבין א-צאנע(ישוב)', 'תראבין א-צאנע (שבט)', 'תקוע', 'תקומה', 'תפרח', 'תעוז', 'תנובות',
                     'תמרת', 'תלמים', 'תלמי יפה', 'תלמי יחיאל', 'תלמי יוסף', 'תלמי ביל"ו', 'תלמי אלעזר', 'תלמי אליהו',
                     'תלם', 'תל תאומים', 'תל שבע', 'תל קציר', 'תל עדשים', 'תל מונד', 'תל יצחק', 'תל יוסף',
                     'תל אביב - יפו', 'תירוש', 'תימורים', 'תושיה', 'תומר', 'תובל', 'תדהר', 'תאשור', 'שתולים', 'שתולה',
                     'שרשרת', 'שריד', 'שריגים (לי-און)', 'שרונה', 'שקף', 'שקד', 'שפרעם', 'שפר', 'שפיר', 'שפיים',
                     'שער שומרון', 'שער מנשה', 'שער העמקים', 'שער הגולן', 'שער אפרים', 'שעלבים', 'שעל', 'שעב', 'שניר',
                     'שני', 'שמשית', 'שמרת', 'שמעה', 'שמיר', 'שלומית', 'שלומי', 'שלוחות', 'שלווה במדבר', 'שלווה',
                     'שכניה', 'שילת', 'שילה', "שייח' דנון", 'שיטים', 'שיזף', 'שיבולים', 'שחרות', 'שחר', 'שזור',
                     'שושנת העמקים', 'שורשים', 'שורש', 'שוקדה', 'שומריה', 'שומרה', 'שוהם', 'שובל', 'שובה', 'שואבה',
                     'שדרות', 'שדמות מחולה', 'שדמות דבורה', 'שדמה', 'שדי תרומות', 'שדי חמד', 'שדי אברהם', 'שדות מיכה',
                     'שדות ים', 'שדה צבי', 'שדה עוזיהו', 'שדה ניצן', 'שדה נחמיה', 'שדה נחום', 'שדה משה', 'שדה יצחק',
                     'שדה יעקב', 'שדה יואב', 'שדה ורבורג', 'שדה דוד', 'שדה בוקר', 'שדה אליעזר', 'שדה אליהו', 'שדה אילן',
                     'שגב-שלום', 'שבלי - אום אל-גנם', 'שבי שומרון', 'שבי ציון', 'שבי דרום', 'שאר ישוב', 'רתמים',
                     'רשפים', 'רשפון', 'רקפת', 'רעננה', 'רעים', 'רנן', 'רמת רחל', 'רמת רזיאל', 'רמת צבי', 'רמת מגשימים',
                     'רמת ישי', 'רמת יוחנן', 'רמת טראמפ', 'רמת השרון', 'רמת השופט', 'רמת הכובש', 'רמת דוד', 'רמת גן',
                     'רמלה', 'רמות נפתלי', 'רמות מנשה', 'רמות מאיר', 'רמות השבים', 'רמות', 'רם-און', 'רכסים', 'רינתיה',
                     'רימונים', 'ריינה', 'ריחן', 'ריחאניה', 'רחלים', 'רחובות', 'רחוב', 'רותם', 'רועי', 'רומת הייב',
                     'רומאנה', 'רוחמה', 'רוח מדבר', 'רוויה', 'רווחה', 'רהט', 'רגבים', 'רגבה', 'רביד', 'רביבים', 'רבדים',
                     'רבבה', 'ראשון לציון', 'ראש צורים', 'ראש פינה', 'ראש העין', 'ראס עלי', 'ראס אל-עין', 'ראמה', 'קשת',
                     'קרני שומרון', 'קרית שמונה', 'קרית שלמה', 'קרית עקרון', 'קרית ענבים', 'קרית נטפים', 'קרית מלאכי',
                     'קרית מוצקין', 'קרית יערים(מוסד)', 'קרית יערים', 'קרית ים', 'קרית טבעון', 'קרית גת', 'קרית ביאליק',
                     'קרית אתא', 'קרית ארבע', 'קרית אונו', 'קצרין', 'קצר א-סר', 'קציר', 'קלע', 'קלנסווה', 'קליה',
                     'קלחים', 'קיסריה', 'קטורה', 'קורנית', 'קוממיות', 'קוואעין (שבט)', 'קודייראת א-צאנע(שבט)', 'קדרים',
                     'קדרון', 'קדר', 'קדמת צבי', 'קדמה', 'קדימה-צורן', 'קדומים', 'קבוצת יבנה', 'קבועה (שבט)', 'צרעה',
                     'צרופה', 'צפת', 'צפרירים', 'צפריה', 'צנדלה', 'צלפון', 'ציפורי', 'צורית', 'צוריאל', 'צור נתן',
                     'צור משה', 'צור יצחק', 'צור הדסה', 'צוקים', 'צוקי ים', 'צופר', 'צופית', 'צופים', 'צופיה', 'צוחר',
                     'צובה', 'צבעון', 'צביה', 'צאלים', 'פתחיה', 'פתח תקווה', 'פרי גן', 'פרזון', 'פרוד', 'פרדסיה',
                     'פרדס חנה-כרכור', 'פקיעין חדשה', 'פקיעין (בוקייעה)', 'פצאל', 'פעמי תש"ז', 'פסוטה', 'פסגות',
                     'פני חבר', 'פלמחים', 'פלך', 'פטיש', 'פורת', 'פוריידיס', 'פוריה עילית', 'פוריה - נווה עובד',
                     'פוריה - כפר עבודה', 'פדיה', 'פדויים', 'פדואל', 'פארן', 'עתניאל', 'עתלית', 'עשרת', 'ערערה-בנגב',
                     'ערערה', 'ערוגות', 'ערד', 'ערב אל נעים', 'עראמשה', 'עראבה', 'עצמון שגב', 'עפולה', 'עספיא', 'ענב',
                     'עמקה', 'עמנואל', 'עמיר', 'עמיקם', 'עמיעוז', 'עמיעד', 'עמינדב', 'עמיחי', 'עמוקה', 'עלמון', 'עלמה',
                     'עלי זהב', 'עלי', 'עלומים', 'עכו', 'עיר אובות', 'עינת', 'עין תמר', 'עין שריד', 'עין שמר',
                     'עין ראפה', 'עין קנייא', 'עין צורים', 'עין עירון', 'עין נקובא', 'עין מאהל', 'עין כרמל',
                     'עין כרם-בי"ס חקלאי', 'עין יעקב', 'עין יהב', 'עין חרוד (מאוחד)', 'עין חרוד (איחוד)', 'עין חצבה',
                     'עין חוד', 'עין זיוון', 'עין ורד', 'עין השלושה', 'עין השופט', 'עין העמק', 'עין הנצי"ב',
                     'עין המפרץ', 'עין החורש', 'עין הוד', 'עין הבשור', 'עין דור', 'עין גדי', 'עין גב', 'עין אל-אסד',
                     'עין איילה', 'עילוט', 'עיינות', 'עיילבון', 'עידן', 'עטרת', 'עטאוונה (שבט)', 'עזריקם', 'עזריה',
                     'עזריאל', 'עזר', 'עזוז', 'עוקבי (בנו עוקבה)', 'עוצם', 'עופרה', 'עופר', 'עומר', 'עולש', 'עוזייר',
                     'עוזה', 'עדנים', 'עדי', 'עגור', 'עברון', 'עבדון', "ע'ג'ר", 'סתריה', 'ספיר', 'סער', 'סעוה', 'סעד',
                     'סנסנה', 'סמר', 'סלעית', 'סלמה', 'סייד (שבט)', "סח'נין", 'סופה', 'סוסיה', 'סולם',
                     'סואעד (כמאנה) (שבט)', 'סואעד (חמרייה)', 'סגולה', 'סביון', 'סאסא', "סאג'ור", 'נתניה', 'נתיבות',
                     'נתיב השיירה', 'נתיב העשרה', 'נתיב הל"ה', 'נתיב הגדוד', 'נשר', 'נצרת', 'נצר סרני', 'נצר חזני',
                     'נצאצרה (שבט)', 'נערן', 'נען', 'נעמ"ה', 'נעלה', 'נעורים', 'נס ציונה', 'נס עמים', 'נס הרים',
                     'נמרוד', 'נירית', 'נירים', 'ניר צבי', 'ניר עקיבא', 'ניר עציון', 'ניר עם', 'ניר עוז', 'ניר משה',
                     'ניר ישראל', 'ניר יצחק', 'ניר יפה', 'ניר ח"ן', 'ניר דוד (תל עמל)', 'ניר גלים', 'ניר בנים',
                     'ניר אליהו', 'ניצנים', 'ניצני עוז', 'ניצני סיני', 'ניצנה (קהילת חינוך)', "ניצן ב'", 'ניצן',
                     'ניל"י', 'ניין', 'נטף', 'נטעים', 'נטע', 'נטור', 'נטועה', 'נחשונים', 'נחשון', 'נחשולים', 'נחף',
                     'נחם', 'נחלים', 'נחליאל', 'נחלה', 'נחל עוז', 'נחושה', 'נורית', 'נורדיה', 'נוקדים', 'נופך', 'נופית',
                     'נופים', 'נוף הגליל', 'נוף איילון', 'נועם', 'נווה שלום', 'נווה מיכאל', 'נווה מבטח', 'נווה ירק',
                     'נווה ימין', 'נווה ים', 'נווה חריף', 'נווה זיו', 'נווה זוהר', 'נווה דניאל', 'נווה איתן',
                     'נווה אילן', 'נווה אטי"ב', 'נווה אור', 'נווה אבות', 'נווה', 'נוה צוף', 'נוגה', 'נוב', 'נהריה',
                     'נהלל', 'נהורה', 'נגוהות', 'נגבה', 'נבטים', 'נאעורה', 'נאות סמדר', 'נאות מרדכי', 'נאות הכיכר',
                     'נאות גולן', 'מתתיהו', 'מתת', 'מתן', 'משען', 'משמרת', 'משמרות', 'משמר השרון', 'משמר השבעה',
                     'משמר העמק', 'משמר הנגב', 'משמר הירדן', 'משמר דוד', 'משמר איילון', 'משכיות', 'משואות יצחק',
                     'משואה', 'משהד', 'משגב עם', 'משגב דב', 'משאבי שדה', 'מרכז שפירא', 'מרחביה (קיבוץ)',
                     'מרחביה (מושב)', 'מרחב עם', 'מרום גולן', 'מרגליות', 'מקווה ישראל', 'מצר', 'מצפה שלם', 'מצפה רמון',
                     'מצפה נטופה', 'מצפה יריחו', 'מצפה אילן', 'מצפה אבי"ב', 'מצפה', 'מצליח', 'מצובה', 'מצדות יהודה',
                     'מפלסים', 'מעש', 'מענית', 'מעלות-תרשיחא', 'מעלה עמוס', 'מעלה עירון', 'מעלה מכמש', 'מעלה לבונה',
                     'מעלה החמישה', 'מעלה גמלא', 'מעלה גלבוע', 'מעלה אפרים', 'מעלה אדומים', 'מעין צבי', 'מעין ברוך',
                     'מעיליא', 'מעונה', 'מעון', 'מעוז חיים', 'מעגן מיכאל', 'מעגן', 'מעגלים', 'מעברות',
                     'מסעודין אל-עזאזמה', 'מסעדה', 'מסלול', 'מסילת ציון', 'מסילות', 'מסדה', 'מסד', 'מנשית זבדה', 'מנרה',
                     'מנחמיה', 'מנות', 'מנוף', 'מנוחה', 'מלכיה', 'מלילות', 'מלאה', 'מכמנים', 'מכמורת', 'מכחול', 'מכורה',
                     'מיתר', 'מישר', 'מירון', 'מירב', 'מיצר', 'מייסר', 'מיטל', 'מיטב', 'מי עמי', 'מטע', 'מטולה',
                     'מחסיה', 'מחניים', 'מחנה תל נוף', 'מחנה מרים', 'מחנה יתיר', 'מחנה יפה', 'מחנה יוכבד',
                     'מחנה יהודית', 'מחנה טלי', 'מחנה הילה', 'מחולה', 'מזרעה', 'מזרע', 'מזכרת בתיה', 'מזור', 'מורשת',
                     'מורן', 'מוקייבלה', 'מוצא עילית', 'מולדת', 'מודיעין-מכבים-רעות', 'מודיעין עילית', 'מדרשת רופין',
                     'מדרשת בן גוריון', 'מדרך עוז', 'מגשימים', 'מגן שאול', 'מגן', 'מגל', 'מגידו', 'מגדלים', 'מגדל עוז',
                     'מגדל העמק', 'מגדל', 'מגדים', 'מגאר', "מג'דל שמס", "מג'ד אל-כרום", 'מבשרת ציון', 'מבקיעים',
                     'מבטחים', 'מבועים', 'מבואות יריחו', 'מבואות ים', 'מבוא מודיעים', 'מבוא חמה', 'מבוא חורון',
                     'מבוא דותן', 'מבוא ביתר', 'מאיר שפיה', 'מאור', 'לקיה', 'לפידות', 'לפיד', 'לכיש', 'לימן', 'לוטן',
                     'לוטם', 'לוחמי הגיטאות', 'לוזית', 'לוד', 'להבים', 'להבות חביבה', 'להבות הבשן', 'להב', 'לבנים',
                     'לביא', 'לבון', 'כרמל', 'כרמים', 'כרמיה', 'כרמיאל', 'כרמי קטיף', 'כרמי צור', 'כרמי יוסף',
                     'כרם שלום', 'כרם מהר"ל', 'כרם בן שמן', 'כרם בן זמרה', 'כרם ביבנה (ישיבה)', 'כרכום', 'כרי דשא',
                     'כפר תפוח', 'כפר תבור', 'כפר שמריהו', 'כפר שמואל', 'כפר שמאי', 'כפר רות', 'כפר רופין',
                     'כפר רוזנואלד (זרעית)', 'כפר ראש הנקרה', 'כפר קרע', 'כפר קיש', 'כפר קאסם', 'כפר פינס', 'כפר עציון',
                     'כפר עזה', 'כפר עבודה', 'כפר סירקין', 'כפר סילבר', 'כפר סבא', 'כפר סאלד', 'כפר נטר', 'כפר מרדכי',
                     'כפר מצר', 'כפר מסריק', 'כפר מנחם', 'כפר מנדא', 'כפר מל"ל', 'כפר מימון', 'כפר מונש', 'כפר כנא',
                     'כפר כמא', 'כפר יעבץ', 'כפר יחזקאל', 'כפר יונה', 'כפר יהושע', 'כפר ידידיה', 'כפר יאסיף',
                     'כפר טרומן', 'כפר חרוב', "כפר חסידים ב'", "כפר חסידים א'", 'כפר חנניה', 'כפר חיים', 'כפר חיטים',
                     'כפר חושן', 'כפר חב"ד', 'כפר זיתים', 'כפר זוהרים', 'כפר ורדים', 'כפר ורבורג', 'כפר ויתקין',
                     'כפר הרי"ף', 'כפר הרא"ה', 'כפר הס', 'כפר הנשיא', 'כפר הנוער הדתי', 'כפר הנגיד', 'כפר המכבי',
                     'כפר החורש', 'כפר האורנים', 'כפר דניאל', 'כפר גלעדי', 'כפר גליקסון', 'כפר גלים', 'כפר גדעון',
                     'כפר ברוך', 'כפר ברא', 'כפר בן נון', 'כפר בלום', 'כפר ביל"ו', 'כפר ביאליק', 'כפר אחים',
                     'כפר אוריה', 'כפר אדומים', 'כפר אביב', "כעביה-טבאש-חג'אג'רה", 'כסרא-סמיע', 'כסלון', 'כסיפה',
                     'כנרת (קבוצה)', 'כנרת (מושבה)', 'כנף', 'כנות', 'כמון', 'כמהין', 'כמאנה', 'כלנית', 'כליל', 'כישור',
                     'כיסופים', 'כחלה', 'כחל', 'כורזים', 'כוכב מיכאל', 'כוכב יעקב', 'כוכב יאיר', 'כוכב השחר', 'כדיתה',
                     'כדורי', 'כברי', "כאוכב אבו אל-היג'א", 'כאבול', 'יתד', 'ישרש', 'ישעי', 'ישע', 'ירקונה', 'ירכא',
                     'ירחיב', 'ירושלים', 'ירוחם', 'ירדנה', 'יראון', 'יקנעם עילית', 'יקנעם (מושבה)', 'יקיר', 'יקום',
                     'יציץ', 'יצהר', 'יפתח', 'יפעת', 'יפית', 'יפיע', 'יערה', 'יעף', 'יעל', 'יעד', 'יסעור', 'יסודות',
                     'יסוד המעלה', 'ינון', 'ינוב', 'יכיני', 'ייט"ב', 'יטבתה', 'יחיעם', 'יזרעאל', 'יושיביה', 'יונתן',
                     'יודפת', 'יובלים', 'יובל', 'יהל', 'יהוד-מונוסון', 'ידידה', 'יד רמב"ם', 'יד נתן', 'יד מרדכי',
                     'יד חנה', 'יד השמונה', 'יד בנימין', 'יגל', 'יגור', 'יבנה', 'יבנאל', 'יבול', "יאנוח-ג'ת", 'טפחות',
                     'טנא', 'טמרה (יזרעאל)', 'טמרה', 'טלמון', 'טללים', 'טל-אל', 'טל שחר', 'טירת צבי', 'טירת כרמל',
                     'טירת יהודה', 'טירה', 'טייבה (בעמק)', 'טייבה', 'טורעאן', 'טובא-זנגריה', 'טבריה', 'חשמונאים',
                     'חרשים', 'חרמש', 'חריש', 'חרוצים', 'חרב לאת', 'חצרים', 'חצור-אשדוד', 'חצור הגלילית', 'חצבה', 'חצב',
                     'חפצי-בה', 'חפץ חיים', 'חספין', 'חנתון', 'חניתה', 'חניאל', 'חמרה', 'חמדת', 'חמדיה', 'חמד', 'חמאם',
                     'חלץ', 'חלוץ', 'חירות', 'חיפה', 'חיננית', 'חיבת ציון', 'חזון', 'חורשים', 'חורפיש', 'חורה', 'חוקוק',
                     'חופית', 'חוסנייה', 'חוסן', 'חולתה', 'חולית', 'חולון', 'חולדה', "חוג'ייראת (ד'הרה)", 'חדרה',
                     'חדיד', 'חד-נס', 'חגלה', 'חגי', 'חגור', 'חברון', 'חבר', 'חבצלת השרון', "ח'ואלד (שבט)", "ח'ואלד",
                     'זרחיה', 'זרזיר', 'זרועה', 'זנוח', 'זמרת', 'זמר', 'זכריה', 'זכרון יעקב', 'זיתן', 'זיקים', 'זוהר',
                     'זבדיאל', 'זבארגה (שבט)', 'ורדון', 'ורד יריחו', 'הררית', 'הרצליה', 'הרדוף', 'הראל', 'הר עמשא',
                     'הר גילה', 'הר אדר', 'העוגן', 'הסוללים', 'המעפיל', 'הילה', 'היוגב', 'החותרים', 'הזורעים', 'הזורע',
                     'הושעיה', 'הוזייל (שבט)', 'הוואשלה (שבט)', 'הודיות', 'הודיה', 'הוד השרון', 'הדר עם', 'הגושרים',
                     'הבונים', 'האון', "דריג'את", 'דקל', 'דפנה', 'דן', 'דמיידה', 'דלתון', 'דליה', 'דישון', 'דימונה',
                     'דייר ראפאת', 'דייר חנא', 'דייר אל-אסד', 'דחי', 'דורות', 'דור', 'דולב', 'דוב"ב', "דגניה ב'",
                     "דגניה א'", 'דברת', 'דביר', 'דבוריה', 'דבורה', 'דאלית אל-כרמל', 'גת רימון', 'גת (קיבוץ)',
                     'גשר הזיו', 'גשר', 'גשור', 'גרופית', 'גפן', 'געתון', 'געש', 'גני תקווה', 'גני עם', 'גני מודיעין',
                     'גני יוחנן', 'גני טל', 'גני הדר', 'גנות הדר', 'גנות', 'גן שמואל', 'גן שלמה', 'גן שורק', 'גן נר',
                     'גן יבנה', 'גן יאשיה', 'גן חיים', 'גן השומרון', 'גן הדרום', 'גמזו', 'גלעד (אבן יצחק)', 'גליל ים',
                     'גלגל', 'גלאון', 'גיתית', 'גיתה', 'גינתון', 'גיניגר', 'גינוסר', 'גילת', 'גילון', 'גיזו', 'גיבתון',
                     'גיאה', 'גזר', 'גזית', 'גורנות הגליל', 'גורן', 'גונן', 'גדרה', 'גדעונה', 'גדיש', 'גדות', 'גבת',
                     'גברעם', 'גבעתיים', 'גבעתי', 'גבעת שפירא', 'גבעת שמש', 'גבעת שמואל', 'גבעת עוז', 'גבעת ניל"י',
                     'גבעת כ"ח', 'גבעת ישעיהו', 'גבעת יערים', 'גבעת יואב', 'גבעת חיים (מאוחד)', 'גבעת חיים (איחוד)',
                     'גבעת ח"ן', 'גבעת זאב', 'גבעת השלושה', 'גבעת ברנר', 'גבעת אלה', 'גבעת אבני', 'גבעות עדן',
                     'גבעות בר', 'גבעון החדשה', 'גבעולים', 'גבע כרמל', 'גבע בנימין', 'גבע', 'גבים', 'גבולות', 'גאליה',
                     'גאולים', 'גאולי תימן', "ג'ת", "ג'ש (גוש חלב)", "ג'סר א-זרקא", "ג'נאביב (שבט)", "ג'לג'וליה",
                     "ג'ולס", "ג'דיידה-מכר", 'בת שלמה', 'בת עין', 'בת ים', 'בת חפר', 'בת חן', 'בת הדר', 'ברקת', 'ברקן',
                     'ברקאי', 'ברק', 'ברעם', 'ברכיה', 'ברכה', 'ברוש', 'ברור חיל', 'ברוכין', 'בר יוחאי', 'בר גיורא',
                     'בקעות', 'בקוע', 'בצת', 'בצרה', 'בענה', 'בסמת טבעון', 'בסמ"ה', 'בנימינה-גבעת עדה', 'בניה',
                     'בני ראם', 'בני ציון', 'בני עי"ש', 'בני עטרות', 'בני נצרים', 'בני יהודה', 'בני דרור', 'בני דרום',
                     'בני דקלים', 'בני ברק', 'בן שמן (מושב)', 'בן שמן (כפר נוער)', 'בן עמי', 'בן זכאי', 'בלפוריה',
                     'ביתר עילית', 'ביתן אהרן', 'בית שקמה', 'בית שערים', 'בית שמש', 'בית שאן', 'בית רימון', 'בית רבן',
                     'בית קשת', 'בית קמה', 'בית צבי', 'בית עריף', 'בית עזרא', 'בית עוזיאל', 'בית עובד', 'בית נקופה',
                     'בית ניר', 'בית נחמיה', 'בית מאיר', 'בית לחם הגלילית', 'בית יצחק-שער חפר', 'בית ינאי', 'בית יוסף',
                     'בית יהושע', 'בית חשמונאי', 'בית חנניה', 'בית חנן', 'בית חלקיה', 'בית חירות', 'בית חורון',
                     'בית זרע', 'בית זית', 'בית זיד', 'בית השיטה', 'בית הערבה', 'בית העמק', 'בית הלל', 'בית הלוי',
                     'בית הגדי', 'בית דגן', 'בית גמליאל', 'בית גוברין', "בית ג'ן", 'בית ברל', 'בית אריה', 'בית אלפא',
                     'בית אלעזרי', 'בית אל', 'בית אורן', 'ביריה', "ביר הדאג'", 'ביר אל-מכסור', 'ביצרון', 'בטחה', 'בחן',
                     'בורגתה', 'בוקעאתא', "בועיינה-נוג'ידאת", 'בוסתן הגליל', 'בארי', 'בארותיים', 'בארות יצחק',
                     'באר שבע', 'באר מילכה', 'באר יעקב', 'באר טוביה', 'באר גנים', 'באר אורה', 'באקה אל-גרביה', 'אתגר',
                     'אשתאול', 'אשרת', 'אשקלון', 'אשלים', 'אשל הנשיא', 'אשכולות', 'אשחר', 'אשדות יעקב (מאוחד)',
                     'אשדות יעקב (איחוד)', 'אשדוד', 'אשבל', 'אשבול', 'ארסוף', 'אריאל', 'ארז', 'ארגמן', 'ארבל', 'אפרת',
                     'אפק', 'אפיקים', 'אפיק', 'אפיניש (שבט)', 'אעצם (שבט)', 'אעבלין', 'אספר', 'אסד (שבט)', 'אניעם',
                     'אמציה', 'אמנון', 'אמירים', 'אמונים', 'אלקנה', 'אלקוש', 'אלפי מנשה', 'אלעזר', 'אלעד', 'אלמוג',
                     'אלמגור', 'אלישמע', 'אלישיב', 'אליקים', 'אליפלט', 'אליפז', 'אליכין', 'אליאב', 'אלי-עד', 'אלונים',
                     'אלוני יצחק', 'אלוני הבשן', 'אלוני אבא', 'אלון שבות', 'אלון מורה', 'אלון הגליל', 'אלומות', 'אלומה',
                     'אל-רום', 'אל-עריאן', 'אל-עזי', 'אל סייד', 'אכסאל', 'איתנים', 'איתן', 'איתמר', 'אירוס', 'אילת',
                     'אילניה', 'אילות', 'אילון', 'איילת השחר', 'אייל', 'איבים', 'אטרש (שבט)', 'אחיעזר', 'אחיסמך',
                     'אחיטוב', 'אחיהוד', 'אחוזת ברק', 'אחוזם', 'אחווה', 'אזור', 'אושה', 'אורנית', 'אורנים', 'אורים',
                     'אורטל', 'אורות', 'אורה', 'אור עקיבא', 'אור יהודה', 'אור הנר', 'אור הגנוז', 'אופקים', 'אומץ',
                     'אומן', 'אום בטין', 'אום אל-קוטוף', 'אום אל-פחם', 'אוהד', 'אודם', 'אודים', 'אדרת', 'אדמית',
                     'אדירים', 'אדורה', 'אבשלום', 'אבנת', 'אבני חפץ', 'אבני איתן', 'אבן שמואל', 'אבן ספיר', 'אבן מנחם',
                     'אבן יהודה', 'אבירים', 'אביעזר', 'אביטל', 'אביחיל', 'אביגדור', 'אביבים', 'אביאל', 'אבטליון',
                     'אבטין', 'אבו תלול', 'אבו רוקייק (שבט)', 'אבו רובייעה (שבט)', 'אבו קרינאת (יישוב)',
                     'אבו קורינאת (שבט)', 'אבו עמרה (שבט)', 'אבו עמאר (שבט)', 'אבו עבדון (שבט)', 'אבו סריחאן (שבט)',
                     'אבו סנאן', 'אבו גוש', "אבו ג'ווייעד (שבט)", 'מועצה אזורית אל קסום', 'מועצה אזורית אל-בטוף',
                     'מועצה אזורית אלונה', 'מועצה אזורית אשכול', 'מועצה אזורית באר טוביה',
                     "מועצה אזורית בוסתאן אל-מרג'", 'מועצה אזורית בני שמעון', 'מועצה אזורית ברנר', 'מועצה אזורית גדרות',
                     'מועצה אזורית גולן', 'מועצה אזורית גוש עציון', 'מועצה אזורית גזר', 'מועצה אזורית גן רווה',
                     'מועצה אזורית דרום השרון', 'מועצה אזורית הגלבוע', 'מועצה אזורית הגליל העליון',
                     'מועצה אזורית הגליל התחתון', 'מועצה אזורית הערבה התיכונה', 'מועצה אזורית הר חברון',
                     'מועצה אזורית זבולון', 'מועצה אזורית חבל אילות', 'מועצה אזורית חבל יבנה',
                     'מועצה אזורית חבל מודיעין', 'מועצה אזורית חוף אשקלון', 'מועצה אזורית חוף הכרמל',
                     'מועצה אזורית חוף השרון', 'מועצה אזורית יואב', 'מועצה אזורית לב השרון', 'מועצה אזורית לכיש',
                     'מועצה אזורית מבואות החרמון', 'מועצה אזורית מגידו', 'מועצה אזורית מגילות ים המלח',
                     'מועצה אזורית מטה אשר', 'מועצה אזורית מטה בנימין', 'מועצה אזורית מטה יהודה', 'מועצה אזורית מנשה',
                     'מועצה אזורית מעלה יוסף', 'מועצה אזורית מרום הגליל', 'מועצה אזורית מרחבים', 'מועצה אזורית משגב',
                     'מועצה אזורית נווה מדבר', 'מועצה אזורית נחל שורק', 'מועצה אזורית עמק הירדן',
                     'מועצה אזורית עמק המעיינות', 'מועצה אזורית עמק חפר', 'מועצה אזורית עמק יזרעאל',
                     'מועצה אזורית ערבות הירדן', 'מועצה אזורית רמת הנגב', 'מועצה אזורית שדות דן']
    
    for doc in docs:
        highest_score = 0
        best_match = ""
        for actual_city in cities_israel_heb:
            score = textdistance.jaro_winkler(doc.city, actual_city)
            if score > highest_score:
                highest_score = score
                best_match = actual_city
                
        doc.city = best_match
    
    return docs